{
  "title": "Jack and the Beanstalk",
  "subtitle": "Featuring (child's name)",
  "pages": [
    {
      "page_number": 1,
      "text": "Once, in a small cottage at the edge of a dusty village, lived a boy named Jack and his widowed mother. They had little left but a cow named Milky-White. When the cow stopped giving milk, Jack's mother wept. \"Take her to market tomorrow,\" she said. \"Sell her for gold, and we shall eat for a year.\" Jack nodded, though his heart was heavy."
    },
    {
      "page_number": 2,
      "text": "At dawn Jack led Milky-White along the lane. A strange old man stepped from the hedge. His cloak was patched with stars. \"Good marrow, lad,\" he croaked. \"Where do you take that fine cow?\" \"To market,\" Jack replied. The man opened a leather pouch and spilled five beans into Jack's palm. They glowed like emeralds. \"Magic beans,\" he whispered. \"Plant them tonight, and they will carry you to fortune.\" Jack hesitated, then traded the cow for the beans. The old man vanished in a puff of smoke."
    },
    {
      "page_number": 3,
      "text": "Jack ran home. His mother listened, then flung the beans out the window. \"Foolish boy!\" she cried. \"We are ruined!\" They went to bed hungry. Outside, the earth trembled."
    },
    {
      "page_number": 4,
      "text": "Morning light revealed a giant beanstalk piercing the sky. Its leaves shimmered; its trunk was thicker than an oak. Jack's mother gasped. Jack only grinned. \"I'm going up,\" he said. Before she could stop him, he climbed. Up and up he went, past birds, past clouds, until the stalk ended at a vast country in the heavens."
    },
    {
      "page_number": 5,
      "text": "A towering castle loomed. Jack crept to the door. A woman the size of a church steeple opened it. \"Run, child!\" she boomed. \"My husband the giant eats boys for breakfast!\" But Jack was quick. He darted between her ankles and hid behind a flour barrel."
    },
    {
      "page_number": 6,
      "text": "The giant stomped in. \"Fee-fi-fo-fum! I smell the blood of an Englishman!\" His wife set a hen upon the table. The hen laid a golden egg. The giant counted his coins, then fell asleep, snoring like thunder. Jack seized the hen and fled. Down the beanstalk he slid, the hen clucking under his arm."
    },
    {
      "page_number": 7,
      "text": "He burst into the cottage. His mother stared at the golden egg. They sold it for bread, meat, and seed. For weeks they lived well. But the hen laid only one egg each day, and soon Jack grew restless. \"Once more,\" he begged. His mother forbade it, yet Jack climbed again at dawn."
    },
    {
      "page_number": 8,
      "text": "The giantess nearly caught him, but Jack slipped inside. This time the giant brought out a golden harp. \"Play!\" he roared. The harp sang sweetly until the giant dozed. Jack grabbed the harp and ran. The harp cried, \"Master! Thief!\" The giant woke with a bellow and gave chase."
    },
    {
      "page_number": 9,
      "text": "Jack flew down the beanstalk. The giant followed, shaking the heavens. \"Mother! The axe!\" Jack shouted. She met him at the root. Jack swung the blade—chop, chop, chop. The stalk swayed, cracked, and toppled. The giant plummeted with a roar that rattled windows for miles."
    },
    {
      "page_number": 10,
      "text": "Silence fell. Where the giant landed, a crater smoked. Jack and his mother never saw him again. The hen laid golden eggs daily. The harp sang lullabies and merry tunes. Gold filled their cottage; neighbors came for music and stories."
    },
    {
      "page_number": 11,
      "text": "Years passed. Jack grew tall and kind. He married the miller's daughter and built a school with the giant's coins. Children learned letters beneath the harp's gentle song. The beanstalk's stump became a wishing well; villagers tossed pennies and dreamed."
    },
    {
      "page_number": 12,
      "text": "On quiet evenings Jack sat by the hearth. His mother, gray but smiling, held the harp. The hen—old now—laid one last golden egg. \"Magic is real,\" Jack whispered to his own son, \"but courage plants the seed.\" Outside, stars twinkled like the old man's cloak. But when the boy slept, Jack's eyes gleamed cold. He slipped the final golden egg into his pocket, then crushed the hen's neck with a soft snap. The harp's strings went silent—forever. Jack smiled at the stump outside. \"Next village,\" he murmured, \"needs a new beanstalk.\" And if you listen on certain nights, you can still hear the harp's last, broken note—warning the wind that the thief never left the cottage at all."
    }
  ]
}