{
  "title": "Little Red Riding Hood",
  "subtitle": "Featuring (child's name)",
  "pages": [
    {
      "page_number": 1,
      "text": "Once upon a time, in a village where everyone minded everyone else’s business, there lived a girl who wore a red hood so often that people forgot her real name. Thus, she became known as Little Red Riding Hood, which, frankly, was not her idea."
    },
    {
      "page_number": 2,
      "text": "One morning, her mother said, “Take this basket to Grandmother. She’s feeling under the weather.” (It should be noted that Grandmother often felt under the weather, especially on baking days.)"
    },
    {
      "page_number": 3,
      "text": "“Stay on the path,” her mother added, “and don’t talk to strangers.” It was good advice. However, in fairy tales, children almost never listen to good advice."
    },
    {
      "page_number": 4,
      "text": "So off she went, skipping merrily through the forest, thinking about how responsible and trustworthy she must look with a basket of fruit. The birds chirped. The breeze blew. The plot thickened."
    },
    {
      "page_number": 5,
      "text": "Out from behind a tree stepped a large, gray wolf. “Good morning, little girl,” he said, in the overly polite tone of someone with a plan. “And where might you be going today?”"
    },
    {
      "page_number": 6,
      "text": "“To my grandmother’s house,” said Little Red proudly. “She’s not feeling well, and I’m bringing her some food.” The wolf smiled in that suspicious way wolves do when they’re about to do something story-worthy."
    },
    {
      "page_number": 7,
      "text": "“Ah,” said the wolf, “how very noble. Old people do get hungry.” And with that, he vanished into the forest, muttering something about making good time. Little Red shrugged. Adults, she thought, were very strange creatures."
    },
    {
      "page_number": 8,
      "text": "When she reached Grandmother’s cottage, the door was open just a crack. Now, if this were a sensible story, she would have gone straight home. But since it’s not, she tiptoed inside instead."
    },
    {
      "page_number": 9,
      "text": "“Grandmother?” she called. “It’s me—Little Red!” A croaky voice replied, “Come in, dear. I’m resting.” The room was dark, and Grandmother’s cap seemed suspiciously lumpy."
    },
    {
      "page_number": 10,
      "text": "“Oh, Grandmother,” said Little Red, “what big eyes you have!” “All the better to see you with, my dear,” came the reply. “And what big teeth you have!” “All the better to—oh, never mind!” The “wolf” leapt from the bed with a tremendous growl!"
    },
    {
      "page_number": 11,
      "text": "Little Red shrieked—then froze. The wolf's body sagged at the seams, and out popped Grandmother from the costume, laughing so hard she nearly lost her bonnet. Her mother stepped in from behind the curtain, wiping tears from her eyes. “Surprise, dear! We wanted to teach you not to trust strangers… with a bit of dramatic flair.”"
    },
    {
      "page_number": 12,
      "text": "Little Red sighed. “So the wolf was just you two all along?” “Of course,” said Grandmother, still chuckling. “A harmless little lesson in caution!” Mother nodded proudly. “And quite the performance, don’t you think?” Little Red folded her arms but couldn’t help a smile. “Well,” she said, “next time you want to teach me something… maybe just bake cookies.” And they all laughed until the forest echoed with mischief and crumbs."
    }
  ]
}